partitioned-pipe-two-phase/monolithic/system/blockMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant/polyMesh";
    object      blockMeshDict;
}

scale 1;


zmin   0;
zmax  20;

xcells 1;
ycells 10;
zcells 20;

vertices
(
    (0.0 -2.0 $zmin) // 0
    (0.0 2.0  $zmin) // 1
    (0.0 -2.0 $zmax) // 2
    (0.0 2.0 $zmax)// 3
    (-1.0 -2.0 $zmin) // 4
    (-1.0 2.0 $zmin) // 5
    (-1.0 -2.0 $zmax) // 6
    (-1.0 2.0 $zmax) // 7
);

blocks
(
hex (4 0 1 5 6 2 3 7) pipe ($xcells $ycells $zcells)  edgeGrading (1 1 1 1 1 1 1 1 1 1 1 1)
);

edges
(
);


patches
(

    patch fixedWalls
    (
        (0 4 6 2)
        (1 3 7 5)
    )
    
    patch inlet
    (
        (0 1 5 4)
    )
    
    patch outlet
    (
        (3 2 6 7)
    )
);

boundaries
(
    emptyWalls
    {
        type    empty;
        faces
        (
            (0 2 3 1)
            (4 5 7 6)            
        )
    }   
);

mergePatchPairs
(
);
